app/controllers/matieres_controller.rb

SELECT "matieres".* FROM "matieres"
---
  def index
    if isConnected?
      @user = current_user
      if @user.type == 'Admin'
        @matieres = Matiere.all

INSERT INTO "matieres" ("titre", "debut", "fin", "description", "enseignant_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["titre", "ISI"], ["debut", "2015-04-27"], ["fin", "2015-05-27"], ["description", "Systèmes informatiques"], ["enseignant_id", 17]]
---
  def create
    @matiere = Matiere.new(matiere_params)
    # @matiere.enseignant_id = current_user.id
    respond_to do |format|
      if @matiere.save

DELETE FROM "appartenances" WHERE "appartenances"."id" = $1  [["id", 17]]
DELETE FROM "matieres" WHERE "matieres"."id" = $1  [["id", 3]]
---
  def destroy
    @matiere.appartenances.each do |a|
      a.destroy
    end
    @matiere.epreuves.each do |e|
      e.destroy

SELECT  "matieres".* FROM "matieres" WHERE "matieres"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_matiere
      @matiere = Matiere.find(params[:id])