app/controllers/utilisateurs_controller.rb

  def list
    if isConnected? && current_user.type == 'Admin'
      @utilisateurs = Utilisateur.all.sort_by{|user| [user.type, user.nom]}
---
SELECT "utilisateurs".* FROM "utilisateurs"

  def create
    @password = params[:utilisateur][:password]
    if params[:utilisateur][:type]
      @utilisateur = Enseignant.new(utilisateur_params)
    else
      @utilisateur = Etudiant.new(utilisateur_params)
    end
    @utilisateur.etat = 'pending'
    respond_to do |format|
      if @utilisateur.save
---
INSERT INTO "utilisateurs" ("type", "nom", "prenom", "email", "password", "etat") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["type", "Etudiant"], ["nom", "Genaud"], ["prenom", "Stephane"], ["email", "stef@bg.fr"], ["password", "prof"], ["etat", "pending"]]

  def update
    respond_to do |format|
      if @utilisateur.update(utilisateur_params)
---
UPDATE "utilisateurs" SET "password" = $1 WHERE "utilisateurs"."id" = $2  [["password", "pdto"], ["id", 1]]

  def login
    if (user = Utilisateur.find_by(email: params[:email])) != nil
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."email" = $1 LIMIT 1  [["email", "lucas.mull@hotmail.fr"]]

  def submit_password_change
    @utilisateur = current_user
    if @utilisateur.authenticate(params[:old_password])
      @utilisateur.update(:password => params[:new_password], :password_confirmation => params[:new_password_confirmation])
---
UPDATE "utilisateurs" SET "password_digest" = $1 WHERE "utilisateurs"."id" = $2  [["password_digest", "$2a$10$UqwDzZGC7b3ebQ0Xyn.H4.0pWW9oPTkvDQKukNGkTMxmLPs9Cjeqe"], ["id", 1]]

  def confirm
    @utilisateurs = Utilisateur.all
    @utilisateur = Utilisateur.find(params[:id])
    @utilisateur.update_attribute('etat', 'validé')
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = $1 LIMIT 1  [["id", 36]]
UPDATE "utilisateurs" SET "etat" = $1 WHERE "utilisateurs"."id" = $2  [["etat", "validé"], ["id", 36]]

  def confirm_admin
    @utilisateurs = Utilisateur.all
    @utilisateur = Utilisateur.find(params[:id])
    respond_to do |format|
      if @utilisateur.update_attribute('etat', 'validé')
---
SELECT "utilisateurs".* FROM "utilisateurs"
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "utilisateurs" SET "etat" = $1 WHERE "utilisateurs"."id" = $2  [["etat", "validé"], ["id", 2]]

  def destroy
    if @utilisateur.type == 'Enseignant'
      @utilisateur.matieres.each do |m|
        m.destroy
      end
    elsif @utilisateur.type == 'Etudiant'
      @utilisateur.appartenances.each do |a|
        a.destroy
      end
      @utilisateur.resultats.each do |res|
        res.destroy
      end
    else
      respond_to do |format|
        format.html { redirect_to utilisateurs_list_path, notice: 'Impossible de supprimer un compte admin' }
        format.json { head :no_content }
      end
    end
    @utilisateur.destroy
---
SELECT "matieres".* FROM "matieres" WHERE "matieres"."enseignant_id" = $1  [["enseignant_id", 2]]
SELECT "appartenances".* FROM "appartenances" WHERE "appartenances"."etudiant_id" = $1  [["etudiant_id", 3]]
SELECT "resultats".* FROM "resultats" WHERE "resultats"."etudiant_id" = $1  [["etudiant_id", 3]]
DELETE FROM "utilisateurs" WHERE "utilisateurs"."type" IN ('Enseignant') AND "utilisateurs"."id" = $1  [["id", 2]]
DELETE FROM "appartenances" WHERE "appartenances"."id" = $1  [["id", 6]]
DELETE FROM "resultats" WHERE "resultats"."id" = $1  [["id", 2]]

    def set_utilisateur
      @utilisateur = Utilisateur.find(params[:id])
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = $1 LIMIT 1  [["id", 6]]